app/controllers/send_tweet_controller.rb

INSERT INTO "messages" ("message", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message", "Hai i am"], ["user_id", "2"], ["created_at", 2016-09-05 09:06:37 UTC], ["updated_at", 2016-09-05 09:06:37 UTC]]
---
  def create
    Message.create!(:message => twitter_params[:message], :user_id => current_user.id)

SELECT "messages".* FROM "messages"
---
  def retweet
    @messages = Message.all

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."retweet" = $1  [["retweet", true]]
---
  def retweeter_msg
    id = params[:retweet][:id]
    msg = Message.find(id)
    users = User.where(:retweet => true)